/* Шадрин Александр
 */

#include <stdio.h>

/* Задача 1
 * Попробовать оптимизировать пузырьковую сортировку.
 * Сравнить количество операций сравнения
 * оптимизированной и не оптимизированной программы.
 * Написать функции сортировки, которые
 * возвращают количество операций.
 */

int bubble_a()
{}

int bubble_b()
{}

void task_1()
{}

/* 3. Реализовать бинарный алгоритм поиска в виде
 * функции, которой передается отсортированный
 * массив. Функция возвращает индекс найденного
 * элемента или -1, если элемент не найден.
 */